/***********************************************************
* File:     DiscreteMathematics_1_1.cpp
* Author:   Xiaolong Ma(马小龙)
* E-mail:   2353814@tongji.edu.cn
* Compiler: Visual Studio 2022
* Function: Propositional logic reasoning
* Date:     2024.10.19
* Update:   2024.10.19
***********************************************************/

#include <iostream>

/***********************************************************
* Function Name:   main
* Function:        
* Input Parameter: 命题逻辑推理
* Returned Value:  0
***********************************************************/
int main()
{
    //标语
    std::cout << ("*******************************************\n")
              << ("**                                       **\n")
              << ("**         欢迎进入命题逻辑推理系统      **\n")
              << ("**                                       **\n")
              << ("*******************************************\n\n\n");

    //问题描述
    std::cout << "**问题描述**\n"
              << "[命题 1] 营业员 A 或 B 偷了手表\n"
              << "[命题 2] 若 A 作案，则作案不在营业时间\n"
              << "[命题 3] 若 B 提供的证据正确，则货柜未上锁\n"
              << "[命题 4] 若 B 提供的证据不正确，则作案发生在营业时间\n"
              << "[命题 5] 货柜上了锁\n\n";

    //命题变元表示
    std::cout << "**命题变元表示**\n"
              << "命题 A: 营业员 A 偷了手表\n"
              << "命题 B: 营业员 B 偷了手表\n"
              << "命题 C: 作案不在营业时间\n"
              << "命题 D: B 提供的证据正确\n"
              << "命题 E: 货柜未上锁\n\n";

    //命题推理过程
    int A, B, C, D, E;
    for (A = 0; A <= 1; A++)
        for (B = 0; B <= 1; B++)
            for (C = 0; C <= 1; C++)
                for (D = 0; D <= 1; D++)
                    for (E = 0; E <= 1; E++)
                        if ((A || B) && (!A || C) && (!D || E) && (D || !C) && !E) {
                            std::cout << "A=" << A << ",B=" << B << "\n";
                            std::cout << "推理结果是: 是营业员" << (A ? " A " : " B ") << "偷了手表\n\n";
                            std::cout << "欢迎下次再次使用!\n";

                            return 0;
                        }
                            
    
}